package homework_6.task_3;
/*
Task 3
Есть 2 дерева, на одном растут бананы, на другом - кокосы. Дерево состоит из веток (само дерево - главная ветка).
На ветке могут быть фрукты (т.е. бананы или кокосы) и другие ветки.
Для каждой ветки при ее создании можно задать кол-во фруктов, а если не задавать - то рандом.
Есть 3 обезьяны, одна умеет считать кокосы, вторая бананы, а третья - и кокосы и бананы (типо умная)
Есть класс - MonkeyManager, в котором есть метод - попросить любую обезьяну посчитать фрукты на любом дереве*/
public interface Monkey {
}
